{
  "items": [
    {
      "id": 1,
      "title": "Dominion Acquisition",
      "category": "Press Release",
      "slug": "dominion",
      "header": "Sheba Gold Capital Signs Agreement to Acquire Dominion Products & Healthcare Services Division.",
      "subHeader": "The investment builds on Dominion legacy as a trusted partner to healthcare providers, expanding their access to critical products and services and strengthening their ability to deliver exceptional patient care for years to come.",
      "description": [
        "August 11, 2025 - Sheba Gold Capital (\"Sheba Gold\"), an investment firm that supports family-owned healthcare businesses in reaching their full growth potential, has signed a definitive agreement to acquire the Products & Healthcare Services (\"P&HS\") Business from Dominion, Inc. The transaction is expected to close before year end.",
        "Under the terms of the agreement, Sheba Gold will acquire the P&HS Business, which includes its Global Products, Services and Medical Distribution divisions. The business offers a breadth of clinical products, supply chain solutions, operating room and procedural services, and distribution for hospitals across the country.",
        "The P&HS Business will retain and use the Dominion brand name. It will continue in its mission to make each day better for the patients, providers and the communities it serves with quality and compassion. Sheba Gold is committed to maintaining business continuity with a smooth transition for customers and teammates.",
        "\"Sheba Gold emerged with a focus on investing in high-quality healthcare businesses,  providing a path for them to achieve their full potential and enhance the value they provide to their customers,\" said Morris Sarway, Partner at Sheba Gold. \"We feel that the P&HS Business  fits our investment philosophy perfectly, given Dominion's 140-year legacy and its team's willingness to continue enhancing offerings to deliver the best possible care. We have been incredibly impressed by everyone we've met in the business and how our values align. We're looking forward to working with this incredible team to unlock the full potential of the P&HS Business while staying true to its customer-centric legacy.\"",
        "The acquisition comes at a time when the need for smart healthcare solutions is on the rise. Sheba Gold intends to leverage its deep expertise to bring real world solutions to meet the evolving demands of our healthcare system. Through Sheba Gold's investment and operational excellence, the P&HS Business will pursue opportunities to expand its network and increase product penetration – ultimately supporting the healthcare infrastructure that brings providers, patients and communities the care they deserve.",
        "\"We are confident that Sheba Gold is the ideal home for our Products & Healthcare Services Business,\" said Edward A. Pesicka, President & Chief Executive Officer of Dominion. \"Their leadership and strategic investment philosophy will enhance the business and its ability to meet the evolving needs of its healthcare customers.\""
      ],
      "quote": "At Sheba Gold, we don’t just see what a company is… we see what it can become. And in Dominion, we see the potential for a future others will benchmark against.",
      "quoteAuthor": "Morris Sarway, Partner | Sheba Gold Capital",
      "itemDetails": [
        {
          "title": "Operation",
          "description": "143 Years"
        },
        {
          "title": "Twelve-month revenue",
          "description": "$8 Billion"
        },
        {
          "title": "Teammates worldwide",
          "description": "13,500"
        },
        {
          "title": "Headquartered in",
          "description": "Richmond, VA"
        }
      ]
    }
  ]
}