{
  "items": [
    {
      "id": 1,
      "title": "Mission Medical",
      "category": "Healthcare",
      "slug": "mission-medical",
      "description": [
        "Mission Medical Group of Companies was founded about 18 years ago and has since developed into a full range distribution company spanning across the US.",
        "This robust company has established a global presence, conducting business in over 30 countries across six continents. This highly diversified and reputable organization consists of four facility divisions, medical supply, dental supply, health and beauty aids (HBA; big box retailers) and an ECOM division. The medical supply distribution division is ISO certified and is associated in business with the top three medical supply companies in the US."
      ],
      "itemDetails": [
        {
          "title": "Operation",
          "description": "18 years"
        },
        {
          "title": "Business In",
          "description": "30 countries"
        },
        {
          "title": "Distribution in all",
          "description": "50 states"
        },
        {
          "title": "Business over all",
          "description": "6 continents"
        },
        {
          "title": "Headquartered in",
          "description": "Tinton Falls, NJ"
        }
      ]
    },
    {
      "id": 2,
      "title": "Transit Plaza",
      "category": "Real Estate",
      "slug": "transit-plaza",
      "description": [
        "Transit Plaza is a Class A, 214-unit apartment building located at 1 West Dickerson Street. The property consists of 53 one-bedroom, 70 one-bedroom with a den, 84 two-bedroom units and 7 two bedroom two bath apartments. The property was completed in 2021 and has experienced a quick lease up. The property benefits from a 30-year tax pilot, no COAH restrictions, and multiple opportunities to increase revenue. There are 283 garage parking spaces and multiple amenities for tenants to enjoy."
      ],
      "itemDetails": [
        {
          "title": "Date",
          "description": "July 2022"
        },
        {
          "title": "Units",
          "description": "214 units"
        },
        {
          "title": "Amount",
          "description": "$75M"
        }
      ]
    },
    {
      "id": 3,
      "title": "710 Route 46",
      "category": "Real Estate",
      "slug": "710-route",
      "description": [
        "This 104,000 square foot office building is situated on 9.82 acres and is strategically located minutes off Interstate 80. The Property offers unparalleled visibility and accessibility on Route 46 and is surrounded by a plethora of nearby amenities. The 4- story building is currently undergoing significant rehabilitation and aesthetic upgrades. Once renovation is complete, this building will epitomize a state-of-the-art business center complete with modern interior design and notable amenities."
      ],
      "itemDetails": [
        {
          "title": "Property Size",
          "description": "9.82 Acre"
        },
        {
          "title": "Building Size",
          "description": "104,000 SF"
        },
        {
          "title": "Building Type",
          "description": "Commercial / Industrial"
        }
      ]
    },
    {
      "id": 4,
      "title": "611 West Front St",
      "category": "Real Estate",
      "slug": "611-west-front",
      "description": [
        "As an original development plan, the 6.5 acre lot at 611 W. Front Street was to be developed into a 316 unit, five-story building, with surface and covered parking. Seeing the potential in the area, we purchased the neighboring property, 605 W. Front Street and skillfully worked to have it legally merged with 611 W Front Street.",
        "We have currently concluded the approval process for plans that include a two phase development for two buildings with an aggregate of 501 units. This proposed development is within walking distance of the Plainfield Train Station, this transit-oriented development also features a full amenity package including multiple fitness rooms and community rooms, co-working space, a courtyard, and various roof decks."
      ],
      "itemDetails": [
        {
          "title": "Size",
          "description": "5-Acre Fully Approved Site"
        },
        {
          "title": "Tax Pilot",
          "description": "30 Year Tax Pilot"
        },
        {
          "title": "Units",
          "description": "501 Units"
        }
      ]
    }
  ]
}