[
  {
    "name": "Morris Sarway",
    "slug": "morris-sarway",
    "position": "Partner",
    "image": "/images/team/Morris-Sarway.png",
    "experience": [
      "Triple Five Group"
    ],
    "shortBio": "Morris Sarway leads Sheba Gold Capital's investment strategy, driving growth by identifying undervalued opportunities and mobilizing them to create long-term value. He has extensive experience in private equity and M&A. With his hands-on leadership style and creative value-add strategies, Morris has acquired, repositioned and successfully executed more than 60 transactions.",
    "fullBio": [
      "Morris Sarway leads Sheba Gold Capital's investment strategy, driving growth by identifying and building upon businesses' previously untapped opportunities, creating long-term value for their stakeholders and the communities they serve.",
      "Over the course of his career, Morris has spearheaded the acquisition, repositioning, and strategic enhancement of numerous assets. His investment approach blends operational insight with a deep understanding of value creation in complex, regulated industries — making healthcare a natural and meaningful extension of his broader portfolio experience.",
      "Known for his creative approach and disciplined execution, he has built a track record of uncovering overlooked opportunities and transforming complex situations into lasting business outcomes. He brings an entrepreneurial mindset and practical deal experience to every engagement, with a focus on responsible growth and enduring value.",
      "Morris also remains actively engaged in large-scale development projects — including serving as Head of Healthcare Investments for the globally recognized Triple Five Group."
    ]
  },
  {
    "name": "Elie J. Mishaan",
    "slug": "elie-j-mishaan",
    "position": "Chief Investment Officer",
    "image": "/images/team/Elie-Mishaan.png",
    "experience": [
      "Bryant Street Capital Management",
      "Corsair Capital",
      "Lehman Brothers"
    ],
    "shortBio": "Elie J. Mishaan brings 20 years of M&A and investing experience to Sheba Gold Capital, with a proven track record of partnering with management teams to drive shareholder value. He founded Bryant Street Capital in 2020, following leadership roles at Corsair Capital and Lehman Brothers. His deep expertise in corporate transformation is a key asset to Sheba Gold and its partners.",
    "fullBio": [
      "Elie J. Mishaan brings 20 years of M&A and investing experience to Sheba Gold Capital, with a proven track record of partnering with management teams to drive shareholder value.",
      "He is the founder of Bryant Street Capital Management, launched in 2020 to invest in a concentrated portfolio of companies executing value-creating transformations.",
      "Prior to founding Bryant Street, Elie was a senior analyst at Corsair Capital Management, where he led investments in companies doing spinoffs, mergers, divestitures and other corporate change.",
      "He began his career in the M&A group at Lehman Brothers advising clients in the Power & Utilities sector on divestitures, mergers and leveraged buy-outs.",
      "Elie's experience and strategic insight are invaluable assets to both Sheba Gold and our partners."
    ]
  },
  {
    "name": "Jonathan Weiss",
    "slug": "jonathan-weiss",
    "position": "Senior Managing Director - Corporate Development",
    "image": "/images/team/Jonathan-Weiss.png",
    "experience": [
      "JSW Real Estate",
      "Eastern Union",
      "G2 Investment Partners"
    ],
    "shortBio": "Jonathan Weiss brings deep expertise in capital markets, deal execution, and strategic advisory to his role where he is responsible for driving the expansion of Sheba Gold. He previously led over $2.4 billion in transactions as Managing Director at a national real estate firm and helped raise over $150 million in equity at Eastern Union. His strategic vision is key to Sheba Gold's growth.",
    "fullBio": [
      "Jonathan Weiss brings deep expertise in capital markets, deal execution, and strategic advisory to his role where he is responsible for driving the expansion of Sheba Gold. His expert analysis and strategic vision help define the Company's growth initiatives.",
      "Previously, he was a Managing Director at a leading national multifamily real estate firm, where he led a team through over 120 transactions totaling more than $2.4 billion.",
      "He began his career as lead analyst in the Equity Brokerage Division at Eastern Union Funding, helping raise over $150 million of equity for more than $1 billion in nationwide real estate deals.",
      "Prior to that, Jonathan worked as an analyst at G2 Investment Partners, a $750 million small-cap hedge fund."
    ]
  },
  {
    "name": "Yonathan Moas",
    "slug": "yonathan-moas",
    "position": "Director of Finance",
    "image": "/images/team/Yonathan-Moas.png",
    "experience": [
      "Deloitte",
      "EY"
    ],
    "shortBio": "Yonathan Moas lends his more than 15 years of leadership in finance, capital markets, and transactional advisory to his role as a trusted financial liaison for Sheba and its partners. He has played key roles in IPOs totaling $3B and the $130B DowDuPont merger, bringing a people-centered approach to complex transformation and long-term value creation.",
    "fullBio": [
      "Yonathan Moas lends his more than 15 years of leadership in finance, capital markets, and transactional advisory to his role as a trusted financial liaison for Sheba and its partners.",
      "He has supported executive teams through high-impact transitions, including IPOs, mergers, and divestitures, while prioritizing operational continuity and long-term value creation. His experience spans key roles in the $130B DowDuPont merger and the spinoffs of Corteca, Dow Inc., and DuPont, as well as IPOs totaling over $3B.",
      "With a foundation built at Deloitte and EY, Yonathan is known for his people-centered approach to complex transformation, aligning leadership around scalable systems and resilient financial infrastructure."
    ]
  },
  {
    "name": "Aaron Carnahan",
    "slug": "aaron-carnahan",
    "position": "Director of Communications",
    "image": "/images/team/Aaron-Carnahan.png",
    "experience": [
      "Aaron Carnahan Creative",
      "Embark Features",
      "Iris Global Health Film Festival"
    ],
    "shortBio": "Aaron Carnahan is a strategic communicator who uses storytelling to drive Sheba Gold's strategy and advance the Company mission. With a background in award-winning film, Grammy-recognized artist management, and sales leadership, Aaron blends creative vision with operational discipline to craft experiences that align people, elevate purpose, and move organizations forward.",
    "fullBio": [
      "Aaron Carnahan is a strategic communicator who uses storytelling to drive Sheba Gold's strategy and advance the Company mission.",
      "Aaron uses his unique blend of creative vision and operational expertise to bring organization and calm to complex topics—uniting stakeholders around bold visions, building trust, and promoting clarity.",
      "His background spans award-winning film production, Grammy-recognized artist management, and executive leadership in high-performance sales, which has lent to his balanced approach to communications.",
      "He doesn't just manage communications, Aaron crafts experiences that align people, elevate purpose, and meaningfully move organizations forward."
    ]
  },
  {
    "name": "Chavi Mizrahi",
    "slug": "chavi-mizrahi",
    "position": "Executive Coordinator",
    "image": "/images/team/Chavi-Mizrahi.png",
    "experience": [
      "GJ Realty",
      "Best Ship",
      "Miz Hospitality",
      "Heedly"
    ],
    "shortBio": "Chavi Mizrahi supports the Sheba Gold leadership team across a variety of administrative tasks and strategic execution. She brings a dynamic blend of operational expertise, business development acumen, and creative insight to her role. Her previous work with GJ Realty, Best Ship, and Miz Hospitality Group highlights her impact in streamlining operations and scaling growth.",
    "fullBio": [
      "Chavi Mizrahi supports the Sheba Gold leadership team across a variety of administrative tasks and strategic execution. With a strong background in operations, business development, and creative strategy, Chavi plays a key role in supporting Sheba Gold's investment initiatives and corporate growth.",
      "Before joining Sheba Gold, she supported executive teams at GJ Realty and Best Ship, enhancing operational efficiency and strategic planning. She also contributed to the growth of Miz Hospitality Group, helping expand its restaurant portfolio."
    ]
  },
  {
    "name": "Eli B. Abisror",
    "slug": "eli-b-abisror",
    "position": "Partner",
    "image": "/images/team/Eli-Abisror.png",
    "experience": [
      "Sheba Gold",
      "Stonewater",
      "Mission Medical"
    ],
    "shortBio": "Eli Abisror has more than two decades of global healthcare leadership, having built and scaled companies that distribute essential medical products across 30 countries and six continents. He combines operational expertise with a deep respect for the people and systems that power care delivery. Eli’s extensive background also spans real estate and business syndication, where he’s grown ventures with a long-term focus on impact, integrity, and legacy.",
    "fullBio": [
      "Eli Abisror has spent more than 20 years at the intersection of healthcare supply and global business, with a career defined by a commitment to operational excellence and purposeful growth. He has led the development and expansion of multiple international healthcare supply companies, expertly overseeing the reliable distribution of medical and dental products across more than 30 countries and six continents.",
      "Eli's expertise lies in navigating the complexities of global distribution, regulatory requirements, and supply chain infrastructure. Beyond technical execution, his work is grounded in a respect for the people and systems that sustain healthcare — prioritizing reliability, access, and long-term impact in every venture.",
      "As an outgrowth of that experience, Eli founded Sheba Gold — a business development and syndication platform that reflects his broader entrepreneurial vision. Sheba Gold brings together Eli's operational acumen and global perspective to invest in ventures across real estate and healthcare-adjacent industries At its core, Sheba is a continuation of Eli's conviction that success is built on wisdom, wealth and endurance.",
      "Based in Tinton Falls, New Jersey  Eli continues to grow a portfolio of businesses that reflect his values and build a lasting legacy."
    ]
  }
]