[
  {
    "name": "Eli B. Abisror",
    "slug": "eli-b-abisror",
    "position": "Founder & CEO",
    "image": "/images/team/Eli-Abisror.png",
    "experience": [
      "Sheba Gold",
      "Stonewater",
      "Mission Medical"
    ],
    "achievements": [
      {
        "title": "Mastering Business Workflows",
        "id": "001",
        "description": [
          "Throughout his career, Eli has developed a deep understanding of various aspects of the business world.",
          "With a solid grasp of workflows, logistics, and regulatory requirements, particularly in exporting and importing, he possesses the necessary expertise to navigate complex business environments successfully."
        ]
      },
      {
        "title": "Founder of Sheba Gold Capital",
        "id": "003",
        "description": [
          "As an outgrowth of Eli’s personal talents and business drive, Sheba Gold Capital was born. Through this company, Mr. Abisror expertly leverages his extensive experience and talent in both the real estate and business operation to acquire, syndicate and develop real estate ventures and businesses.",
          "By diversifying his syndication efforts, Eli aims to create a broader portfolio that encompasses both real estate and business buildout."
        ]
      },
      {
        "title": "Real Estate Visionary",
        "id": "002",
        "description": [
          "Recognizing the potential in the real estate market, Eli embarked into the real estate world by Co-Founding StoneWater Equities. Over the five year company tenure, he successfully invested in over $250 million of real estate opportunities in the New Jersey area with a specific focus on the residential and industrial markets.",
          "This experience has given him a deep understanding of the intricacies involved in syndication, the ins and outs of the real estate world and the ability to identify lucrative real estate investment opportunities."
        ]
      },
      {
        "title": "Poised for New Opportunities",
        "id": "004",
        "description": [
          "With his proven experience, diverse skill set, and an extensive network of contacts in the business and real estate sectors, Eli Abisror is well-positioned to capitalize on new opportunities, further solidify his reputation, and achieve continued success in the world of business and real estate."
        ]
      }
    ],
    "description": [
      "With 20 years of experience in the business and real estate worlds, Eli Abisror is an experienced and multi-facet professional.",
      "Based in Tinton Falls, he has expertly overseen the distribution of medical and dental supply products, leveraging his extensive knowledge in the medical export and import sectors. He is currently CEO of Mission Medical- founded in 2006 and has since concurrently launched multiple international healthcare supply companies – spanning 30 countries across six continents.",
      "Throughout his career, Eli has developed a deep understanding of various aspects of the business world. With a solid grasp of workflows, logistics, and regulatory requirements, particularly in exporting and importing, he possesses the necessary expertise to navigate complex business environments successfully.",
      "As an outgrowth of Eli’s personal talents and business drive, Sheba Gold was born. Through this company, Eli expertly leverages his extensive experience and talent to acquire, syndicate and develop business ventures. By diversifying his syndication efforts, Eli aims to create a broader portfolio that encompasses both real estate and business buildout.",
      "With his proven experience, diverse skill set and an extensive network of contacts, Eli is well-positioned to capitalize on new opportunities, further solidify his reputation and achieve continued success in the world of business efforts."
    ]
  },
  {
    "name": "Elie J. Mishaan",
    "slug": "elie-j-mishaan",
    "position": "Chief Investment Officer",
    "image": "/images/team/Elie-Mishaan.png",
    "experience": [
      "Bryant Street Capital Management",
      "Corsair Capital",
      "Lehman Brothers"
    ],
    "description": [
      "Elie J. Mishaan began his career in the M&A group at Lehman Brothers, where he advised clients in the Power & Utilities sector on divestitures, mergers and leveraged buy-outs.",
      "In 2007, Elie joined Corsair Capital Management, a special situations hedge fund in NYC. As the senior analyst for most of his years at Corsair, Elie led the firm’s investments in companies going through spinoffs, mergers, divestitures and other corporate change.",
      "Following 13 years at Corsair, Elie launched Bryant Street Capital Management in November 2020 to invest in companies going through transformational corporate actions led by superstar CEOs and CFOs. With a heavy emphasis on management engagement, Bryant Street manages a concentrated portfolio of approximately a dozen special situation stocks that the firm believes have the opportunity to double or triple (or better) over 3-5 years.",
      "Elie has 20 years of experience with companies and management teams that are (or should be) pursuing strategies to create shareholder value."
    ]
  },
  {
    "name": "Morris Sarway",
    "slug": "morris-sarway",
    "position": "Senior Managing Director - Capital Markets",
    "image": "/images/team/Morris-Sarway.png",
    "experience": [
      "Triple Five Group"
    ],
    "description": [
      "Morris Sarway is a hands-on leader with extensive experience in Real Estate, Private Equity and M&A .",
      "His instinctual ability to recognize opportunities in undervalued assets, allows for the maximization of revenue and increased asset valuation.",
      "As Head of Healthcare Investments for the Triple Five Group, Morris is leading the Family Office with their new focus of making strategic investments within the Healthcare segment.",
      "As Managing Director, Morris has been actively involved in leading teams throughout their Real Estate, Private Equity and Financial Services divisions.",
      "With his proactive efforts and creative value-add strategies, Morris has acquired, repositioned and successfully executed more than 60 transactions.",
      "He is an active participant in many large-scale development projects ranging from finance, construction, and operational involvement. Morris holds a master’s degree in Real Estate and Development from Columbia University and an additional MBA from the Touro Graduate School of Business."
    ]
  },
  {
    "name": "Jonathan Weiss",
    "slug": "jonathan-weiss",
    "position": "Senior Managing Director - Corporate Development",
    "image": "/images/team/Jonathan-Weiss.png",
    "experience": [
      "JSW Real Estate",
      "Eastern Union",
      "G2 Investment Partners"
    ],
    "description": [
      "Jonathan Weiss is currently the Managing Partner at JSW Real Estate, a full-service boutique Real Estate firm focusing on value-add opportunities.",
      "Prior to JSW, Jonathan was a Managing Director at large national multifamily real estate Firm for 7 years, where he led the team responsible for closing over 120 transactions with a total deal volume of more than $2.4 billion.",
      "Jonathan specialized in the execution of all stages of the transactions from the underwriting and due diligence through the legal and financing aspects of each deal to ensure a smooth closing. Jonathan started his real estate career at the Equity Brokerage Division of Eastern Union Funding where he was the lead analyst.",
      "During his time at Eastern Union, Jonathan was the lead underwriter and assisted in raising over $150 million of equity for over $1 billion of real estate transactions nationwide. Prior to that, he worked as an analyst at G2 Investment Partners, a small-cap focused Hedge Fund with $750 million under management.",
      "Jonathan holds a Bachelor of Science from Yeshiva University’s Sy Syms School of Business where he was the Valedictorian for the Class of 2013."
    ]
  },
  {
    "name": "Yonathan Moas",
    "slug": "yonathan-moas",
    "position": "Director of Finance",
    "image": "/images/team/Yonathan-Moas.png",
    "experience": [
      "Deloitte",
      "EY"
    ],
    "description": [
      "Yonathan Moas is a seasoned finance and accounting executive with over 15 years of experience leading complex transactions across capital markets, IPO readiness, M&A, and divestitures. He began his career at Deloitte, supporting emerging growth companies and building a strong foundation in technical accounting and strategic advisory. He later joined EY, where he led multidisciplinary teams through transformational events, including IPOs, mergers, and carve-outs.",
      "Notably, Yonathan played a key role in the $130B DowDuPont merger and the successful spin-offs of Corteva ($42.8B), Dow Inc. ($37.8B), and DuPont, ensuring seamless operational separation and stakeholder alignment. His IPO portfolio includes leadership roles in offerings totaling over $3B.",
      "Returning to Deloitte in 2022, Yonathan served as a Capital Markets leader in the Accounting & Reporting Advisory practice, driving IPO strategy, private equity portfolio solutions, and internal control readiness. Yonathan partners with executive sponsors to enhance reporting infrastructure, implement scalable systems, and deliver value in a high-growth, high-speed environment.",
      "With a deep understanding of both the technical and human sides of transformation, Yonathan is recognized for his ability to navigate high-stakes transactions and consistently create long-term value."
    ]
  },
  {
    "name": "Chavi Mizrahi",
    "slug": "chavi-mizrahi",
    "position": "Executive Coordinator",
    "image": "/images/team/Chavi-Mizrahi.png",
    "experience": [
      "GJ Realty",
      "Best Ship",
      "Miz Hospitality",
      "Heedly"
    ],
    "description": [
      "Chavi Mizrahi brings extensive experience in executive coordination and administrative leadership across real estate management, shipping logistics, and hospitality. Before joining Sheba Gold, she served as an Administrative Assistant to the CEO of GJ Realty, where she played a key role in operational efficiency, strategic planning, and executive support.",
      "She later took on the same role at Best Ship, a shipping logistics company, further refining her expertise in high-level administration and organizational management. Additionally, Chavi played a key role in the growth of Miz Hospitality Group, expanding its restaurant portfolio from 2 to 8 locations—with more on the way—by leveraging her strategic and operational skills to support its success.",
      "Earlier in her career, she interned at Heedly, a social media startup, where she gained valuable experience in digital strategy and brand engagement. With a strong background in operations, business development, and creative strategy, Chavi plays an integral role in supporting Sheba Gold’s investment initiatives and corporate growth."
    ]
  }
]
